app/controllers/categories_controller.rb

  def index
    @categories = current_user.categories.includes(:icon_attachment)
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 56]]

  def show
    @category_expenses = @category.expenses.order(created_at: :desc)
    @total_amount = @category_expenses.sum(:amount)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."category_id" = $1 ORDER BY "expenses"."created_at" DESC  [["category_id", 22]]
SELECT SUM("expenses"."amount") FROM "expenses" WHERE "expenses"."category_id" = $1  [["category_id", 22]]

  def set_category
    @category = current_user.categories.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 57], ["id", 22], ["LIMIT", 1]]