app/controllers/categories_controller.rb

  def show
    @category_expenses = @category.expenses.order(created_at: :desc)
    @total_amount = @category_expenses.sum(:amount)
---
SELECT SUM("expenses"."amount") FROM "expenses" WHERE "expenses"."category_id" = $1  [["category_id", 5]]

  def create
    @category = Category.new(category_params)
    @category.user = current_user

    if @category.save
---
INSERT INTO "categories" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Books"], ["icon", nil], ["user_id", 5], ["created_at", "2024-01-27 12:59:54.481588"], ["updated_at", "2024-01-27 12:59:54.481588"]]

  def set_category
    @category = current_user.categories.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 5], ["LIMIT", 1]]