app/controllers/expenses_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 53], ["id", 19], ["LIMIT", 1]]
---
  def new
    @category = current_user.categories.find_by(id: params[:category_id])

INSERT INTO "expenses" ("name", "amount", "author_id", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "New Expense"], ["amount", "50.0"], ["author_id", 58], ["created_at", "2024-01-27 12:15:28.449982"], ["updated_at", "2024-01-27 12:15:28.449982"], ["category_id", 23]]
---
  def create
    @expense = current_user.expenses.build(expense_params)

    if @expense.save